IDEA Connection Link
ConnectionLink.GenerateSourceConnectionData Method
 Opens the application Idea Connection and waits till this application is closed
 Namespace: IdeaRS.ConnectionLink
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public void GenerateSourceConnectionData(
	Action<IIOMSettings, IDEAProgress> myCreateIOM,
	IdeaConImportSettings IdeaConImportSettings,
	IDEAProgress IDEAProgress,
	ref IIdeaProject IdeaProject
)
Public Sub GenerateSourceConnectionData (
	myCreateIOM As Action(Of IIOMSettings, IDEAProgress),
	IdeaConImportSettings As IdeaConImportSettings,
	IDEAProgress As IDEAProgress,
	ByRef IdeaProject As IIdeaProject
)
public:
void GenerateSourceConnectionData(
	Action<IIOMSettings^, IDEAProgress^>^ myCreateIOM,
	IdeaConImportSettings^ IdeaConImportSettings,
	IDEAProgress^ IDEAProgress,
	IIdeaProject^% IdeaProject
)
Parameters
myCreateIOM
Type: System.Action<IIOMSettings, IDEAProgress>
Callback function of IOM creation
IdeaConImportSettings
Type: IdeaConImportSettings
IdeaConImportSettings
IDEAProgress
Type: IDEAProgress
IDEAProgress
IdeaProject
Type: IIdeaProject
IdeaProject
See Also
Reference
ConnectionLink Class
IdeaRS.ConnectionLink Namespace